КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_БазовыеСоответствияНоменклатуры/КонтурЛогистика_БазовыеСоответствияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_БазовыеСоответствияНоменклатуры</name>
  <resources>
    <name>Учитывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПересчетаМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПересчетаМестОбратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПересчетаКоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтгрузочноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеГруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаБруттоКг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемКубМ</name>
    <comment>Необязательное поле</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаНеттоКг</name>
    <comment>необязательная, обязательная - Брутто</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаОбъемМеста</name>
    <comment>если истина - будем считать введенный объем и массы места, а не штуки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопИнформация</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъявленнаяЦенность</name>
    <comment>Стоимость (ценность) груза с налогом - всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъявленнаяЦенностьВалюта</name>
    <comment>Стоимость (ценность) груза с налогом - всего</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_Валюты</types>
    </type>
  </resources>
  <resources>
    <name>СпособУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидТары</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетГрузаВГИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОпасногоГруза</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОписанияОпасныхГрузов</types>
    </type>
  </resources>
  <resources>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Насыпной</name>
    <comment>Насыпной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтранаПроисхождения</name>
    <comment>Страна происхождения продукции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </resources>
  <resources>
    <name>Крупногабаритный</name>
    <comment>только у крупногабаритных грузов в документе ТРН будут указываться габариты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УпаковкаЕдиницаИзмерения</name>
    <type>
      <types>DefinedType.КонтурЛогистика_УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_КонвертацияКлиент/Module.bsl
// конвертация справочников

Процедура ПерейтиКНастройкеКонвертацииСправочника(Форма) Экспорт 
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработчикПоказаВыбораЭлемента", 
		КонтурЛогистика_КонвертацияКлиент, 
		Новый Структура("Форма", Форма));
	
	Форма.СписокНастроекКонвертации.ПоказатьВыборЭлемента(
		ОписаниеОповещения,
		"Выберите настройку конвертации справочников");
	
КонецПроцедуры

Процедура СоздатьНастройкуКонвертации(Форма) Экспорт
	
	Состав = КонтурЛогистика_СтдСтрКлиентСервер.СтрРазделитьЛок(Форма.ИмяФормы, ".");
	
	ПараметрыФормы = Новый Структура("ТипСправочникаЛогистика", Состав[1]);
	
	ОткрытьФормуЭлементаНастроекКонвертации(Форма, ПараметрыФормы);
	
КонецПроцедуры

Процедура ОбработчикПоказаВыбораЭлемента(Результат, ДопПараметры) Экспорт
	
	Если Не Результат = Неопределено
		И ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", Результат.Значение);
		
		ОткрытьФормуЭлементаНастроекКонвертации(ДопПараметры.Форма, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуЭлементаНастроекКонвертации(Форма, ПараметрыФормы)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаЭлемента",
		ПараметрыФормы, Форма,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт 
	
	Если ИмяСобытия = "ПослеЗаписиНастроекКонвертацииСправочников" Тогда
		ОбработчикЗакрытияФормыКонвертации(Форма, Параметр);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработчикЗакрытияФормыКонвертации(Форма, Параметр)
	
	Если ЗначениеЗаполнено(Форма.НастройкаКонвертации) Тогда
		
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьСписокНастроекКонвертации(Форма.СписокНастроекКонвертации, Параметр);
		УправлениеВидимостьюЭлементовФормы(Форма);
		
		Форма.ОбновитьОтображениеДанных();
		
	Иначе 
		
		Форма.Элементы.ПерейтиКНастройкеКонвертацииСправочника.Видимость 	= Ложь;
		Форма.Элементы.НастройкаКонвертацииСправочника.Видимость 			= Ложь;
		Форма.Элементы.КартинкаНастройкиКонвртацииСоздать.Видимость 		= Ложь;
		Форма.Элементы.СоздатьНастройкуКонвертации.Видимость 				= Ложь;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеВидимостьюЭлементовФормы(Форма)
	
	Элементы = Форма.Элементы;
	
	СписокНастроекКонвертации = Форма.СписокНастроекКонвертации;
	
	Элементы.ПерейтиКНастройкеКонвертацииСправочника.Видимость 	= Ложь;
	Элементы.НастройкаКонвертацииСправочника.Видимость 			= Ложь;
	Элементы.КартинкаНастройкиКонвртацииСоздать.Видимость 		= Ложь;
	Элементы.СоздатьНастройкуКонвертации.Видимость 				= Ложь;
	
	Если Форма.СписокНастроекКонвертации.Количество() > 1 Тогда 
		
		Элементы.ПерейтиКНастройкеКонвертацииСправочника.Видимость = Истина;
		
		Элементы.ПерейтиКНастройкеКонвертацииСправочника.Заголовок = "Найдено " + СписокНастроекКонвертации.Количество() + " настройки конвертации. Нажмите для перехода к нужной";
		
	ИначеЕсли СписокНастроекКонвертации.Количество() = 1 Тогда	
		
		Элементы.НастройкаКонвертацииСправочника.Видимость = Истина;
		
		Форма.НастройкаКонвертацииСправочника = Форма.СписокНастроекКонвертации[0].Значение;
		
	Иначе
		
		Если Не Форма.ЕстьКонвертация Тогда
			Элементы.КартинкаНастройкиКонвртацииСоздать.Видимость = Истина;
			Элементы.СоздатьНастройкуКонвертации.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьСоответствияНоменклатуры(текНоменклатура, текЕдиница, текХарактеристика, Форма) Экспорт
	
	Если ЗначениеЗаполнено(текНоменклатура) Тогда

		СтруктураЗаписиОтбора = Новый Структура();
		СтруктураЗаписиОтбора.Вставить("Номенклатура", текНоменклатура);
		
		ВведеноСоответствийНоменклатуры = КонтурЛогистика_КонвертацияСервер.КоличествоСоответствийНоменклатуры(СтруктураЗаписиОтбора, текЕдиница);
		
		Если ВведеноСоответствийНоменклатуры > 1 Тогда

			СтруктураЗаписиОтбора.Вставить("УпаковкаЕдиницаИзмерения", текЕдиница);
			СтруктураЗаписиОтбора.Вставить("Сопоставление", Истина);			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.Форма.ФормаНабораЗаписей",
																		   СтруктураЗаписиОтбора,
																		   Форма,
																		   Форма,
																		   "ОбработчикИзмененияСоответствий",
																		   текНоменклатура);

		 ИначеЕсли ВведеноСоответствийНоменклатуры = 1 Тогда
			 
			КлючПервогоСоответствияНоменклатуры = КонтурЛогистика_КонвертацияСервер.КлючПервогоСоответствияНоменклатуры(СтруктураЗаписиОтбора);
				
			СтруктураЗаписиОтбора.Вставить("Номенклатура", КлючПервогоСоответствияНоменклатуры.Номенклатура);
			СтруктураЗаписиОтбора.Вставить("УпаковкаЕдиницаИзмерения", КлючПервогоСоответствияНоменклатуры.УпаковкаЕдиницаИзмерения);
			СтруктураЗаписиОтбора.Вставить("Характеристика", КлючПервогоСоответствияНоменклатуры.Характеристика);
			
			МассивСтруктурЗаписи = Новый Массив;
			МассивСтруктурЗаписи.Добавить(СтруктураЗаписиОтбора);
			КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.КонтурЛогистика_БазовыеСоответствияНоменклатуры", МассивСтруктурЗаписи);
			
			ПараметрыФормыЗаписи = Новый Структура("Ключ", КлючЗаписи);
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.Форма.ФормаЗаписи",
																			   ПараметрыФормыЗаписи,
																			   Форма,
																			   Форма,
																			   "ОбработчикИзмененияСоответствий",
																			   текНоменклатура);

			
		Иначе // ВведеноСоответствийНоменклатуры = 0

			СтруктураЗаписиОтбора.Вставить("Сопоставление", Истина);
			
			Если ЗначениеЗаполнено(текЕдиница) Тогда 
				СтруктураЗаписиОтбора.Вставить("УпаковкаЕдиницаИзмерения", текЕдиница);
			КонецЕсли;
			Если ЗначениеЗаполнено(текХарактеристика) Тогда 
				СтруктураЗаписиОтбора.Вставить("Характеристика", текХарактеристика);
			КонецЕсли;

			
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.Форма.ФормаЗаписи",
																		   СтруктураЗаписиОтбора,
																		   Форма,
																		   Форма,
																		   "ОбработчикИзмененияСоответствий",
																		   текНоменклатура);

																		   
		КонецЕсли;

	КонецЕсли;																	   
	
КонецПроцедуры

Процедура КонвертироватьОбъектСправочникаЛогистикиВОбъектУС(Форма, НастройкаКонвертацииСправочника) Экспорт 
	
	ЭлСправочникаУС = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_КонвертироватьОбъектЛогистикиВОбъектУС(
		НастройкаКонвертацииСправочника, Форма.Объект.Ссылка, Новый Структура);
		
	Если ТипЗнч(ЭлСправочникаУС) = Тип("Структура")
		И ЭлСправочникаУС.Свойство("ОписаниеОшибки") Тогда
		Сообщить(ЭлСправочникаУС.ОписаниеОшибки);
		Возврат;		
	КонецЕсли;
	
	НайденныеСвязанныеОбъекты = Форма.Объект.СвязанныеОбъекты.НайтиСтроки(Новый Структура("СвязанныйОбъект", ЭлСправочникаУС));
	Если ЗначениеЗаполнено(ЭлСправочникаУС) и НайденныеСвязанныеОбъекты.Количество() = 0 Тогда 
		НоваяСтрока = Форма.Объект.СвязанныеОбъекты.Добавить();
		НоваяСтрока.СвязанныйОбъект = ЭлСправочникаУС;
		
		Форма.Модифицированность = Истина;
	КонецЕсли;
			
КонецПроцедуры
